{"weightsManifest": [{"weights": [{"shape": [13, 60], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [60], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [60, 3], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [3], "dtype": "float32", "name": "dense_2/bias"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"config": {"decay": 0.0, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "lr": 0.004999999888241291, "amsgrad": false}, "class_name": "Adam"}, "loss_weights": null, "sample_weight_mode": null}, "backend": "tensorflow", "model_config": {"config": [{"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 13], "name": "dense_1", "activation": "sigmoid", "units": 60, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "units": 3, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.2.2"}}